Revit 2027 API
ElementReferenceType Enumeration
Element reference types.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElementReferenceType
Public Enumeration ElementReferenceType
public enum class ElementReferenceType
type ElementReferenceType
Members
Member name | Value | Description
REFERENCE_TYPE_CUT_EDGE | 5 | The reference is to a face that was cut (where the original pick was made on the cut edge).
REFERENCE_TYPE_FOREIGN | 3 | The reference is to geometry or elements in linked Revit file.
REFERENCE_TYPE_INSTANCE | 4 | The reference is an instance of a symbol.
REFERENCE_TYPE_LINEAR | 1 | The reference is to a curve or edge.
REFERENCE_TYPE_MESH | 6 | The reference is to a mesh.
REFERENCE_TYPE_NONE | 0 | The reference is to an element.
REFERENCE_TYPE_SUBELEMENT | 7 | The reference is to a subelement.
REFERENCE_TYPE_SURFACE | 2 | The reference is to a face or face region.
See Also
Reference
Autodesk.Revit.DB Namespace